MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA202/mcu.h
#define _IPC12_MI2C2IP2_POSITION                 0x0000000A
#define _IPC12_MI2C2IP2_MASK                     0x00000400
#define _IPC12_MI2C2IP2_LENGTH                   0x00000001

#define _IPC12_SI2C2P0_POSITION                  0x00000004
#define _IPC12_SI2C2P0_MASK                      0x00000010
#define _IPC12_SI2C2P0_LENGTH                    0x00000001

#define _IPC12_SI2C2P1_POSITION                  0x00000005
#define _IPC12_SI2C2P1_MASK                      0x00000020
#define _IPC12_SI2C2P1_LENGTH                    0x00000001

#define _IPC12_SI2C2P2_POSITION                  0x00000006
#define _IPC12_SI2C2P2_MASK                      0x00000040
#define _IPC12_SI2C2P2_LENGTH                    0x00000001

#define _IPC12_MI2C2P0_POSITION                  0x00000008
#define _IPC12_MI2C2P0_MASK                      0x00000100
#define _IPC12_MI2C2P0_LENGTH                    0x00000001

#define _IPC12_MI2C2P1_POSITION                  0x00000009
#define _IPC12_MI2C2P1_MASK                      0x00000200
#define _IPC12_MI2C2P1_LENGTH                    0x00000001

#define _IPC12_MI2C2P2_POSITION                  0x0000000A
#define _IPC12_MI2C2P2_MASK                      0x00000400
#define _IPC12_MI2C2P2_LENGTH                    0x00000001

#define _IPC12_SI2C2P_POSITION                   0x00000004
#define _IPC12_SI2C2P_MASK                       0x00000070
#define _IPC12_SI2C2P_LENGTH                     0x00000003

#define _IPC12_MI2C2P_POSITION                   0x00000008
#define _IPC12_MI2C2P_MASK                       0x00000700
#define _IPC12_MI2C2P_LENGTH                     0x00000003

#define _IPC13_INT3IP_POSITION                   0x00000004
#define _IPC13_INT3IP_MASK                       0x00000070
#define _IPC13_INT3IP_LENGTH                     0x00000003

#define _IPC13_INT4IP_POSITION                   0x00000008
#define _IPC13_INT4IP_MASK                       0x00000700
#define _IPC13_INT4IP_LENGTH                     0x00000003

#define _IPC13_CRYDNIP_POSITION                  0x0000000C
#define _IPC13_CRYDNIP_MASK                      0x00007000
#define _IPC13_CRYDNIP_LENGTH                    0x00000003

#define _IPC13_INT3IP0_POSITION                  0x00000004
#define _IPC13_INT3IP0_MASK                      0x00000010
#define _IPC13_INT3IP0_LENGTH                    0x00000001

#define _IPC13_INT3IP1_POSITION                  0x00000005
#define _IPC13_INT3IP1_MASK                      0x00000020
#define _IPC13_INT3IP1_LENGTH                    0x00000001

#define _IPC13_INT3IP2_POSITION                  0x00000006
#define _IPC13_INT3IP2_MASK                      0x00000040
#define _IPC13_INT3IP2_LENGTH                    0x00000001

#define _IPC13_INT4IP0_POSITION                  0x00000008
#define _IPC13_INT4IP0_MASK                      0x00000100
#define _IPC13_INT4IP0_LENGTH                    0x00000001

#define _IPC13_INT4IP1_POSITION                  0x00000009
#define _IPC13_INT4IP1_MASK                      0x00000200
#define _IPC13_INT4IP1_LENGTH                    0x00000001

#define _IPC13_INT4IP2_POSITION                  0x0000000A
#define _IPC13_INT4IP2_MASK                      0x00000400
#define _IPC13_INT4IP2_LENGTH                    0x00000001

#define _IPC13_CRYDNIP0_POSITION                 0x0000000C
#define _IPC13_CRYDNIP0_MASK                     0x00001000
#define _IPC13_CRYDNIP0_LENGTH                   0x00000001

#define _IPC13_CRYDNIP1_POSITION                 0x0000000D
#define _IPC13_CRYDNIP1_MASK                     0x00002000
#define _IPC13_CRYDNIP1_LENGTH                   0x00000001

#define _IPC13_CRYDNIP2_POSITION                 0x0000000E
#define _IPC13_CRYDNIP2_MASK                     0x00004000
#define _IPC13_CRYDNIP2_LENGTH                   0x00000001

#define _IPC14_KEYSTRIP_POSITION                 0x00000000
#define _IPC14_KEYSTRIP_MASK                     0x00000007
#define _IPC14_KEYSTRIP_LENGTH                   0x00000003

#define _IPC14_SPI1RXIP_POSITION                 0x00000008
#define _IPC14_SPI1RXIP_MASK                     0x00000700
#define _IPC14_SPI1RXIP_LENGTH                   0x00000003

#define _IPC14_SPI2RXIP_POSITION                 0x0000000C
#define _IPC14_SPI2RXIP_MASK                     0x00007000
#define _IPC14_SPI2RXIP_LENGTH                   0x00000003

#define _IPC14_KEYSTRIP0_POSITION                0x00000000
#define _IPC14_KEYSTRIP0_MASK                    0x00000001
#define _IPC14_KEYSTRIP0_LENGTH                  0x00000001

#define _IPC14_KEYSTRIP1_POSITION                0x00000001
#define _IPC14_KEYSTRIP1_MASK                    0x00000002
#define _IPC14_KEYSTRIP1_LENGTH                  0x00000001

#define _IPC14_KEYSTRIP2_POSITION                0x00000002
#define _IPC14_KEYSTRIP2_MASK                    0x00000004
#define _IPC14_KEYSTRIP2_LENGTH                  0x00000001

#define _IPC14_SPI1RXIP0_POSITION                0x00000008
#define _IPC14_SPI1RXIP0_MASK                    0x00000100
#define _IPC14_SPI1RXIP0_LENGTH                  0x00000001

#define _IPC14_SPI1RXIP1_POSITION                0x00000009
#define _IPC14_SPI1RXIP1_MASK                    0x00000200
#define _IPC14_SPI1RXIP1_LENGTH                  0x00000001

#define _IPC14_SPI1RXIP2_POSITION                0x0000000A
#define _IPC14_SPI1RXIP2_MASK                    0x00000400
#define _IPC14_SPI1RXIP2_LENGTH                  0x00000001

#define _IPC14_SPI2RXIP0_POSITION                0x0000000C
#define _IPC14_SPI2RXIP0_MASK                    0x00001000
#define _IPC14_SPI2RXIP0_LENGTH                  0x00000001

#define _IPC14_SPI2RXIP1_POSITION                0x0000000D
#define _IPC14_SPI2RXIP1_MASK                    0x00002000
#define _IPC14_SPI2RXIP1_LENGTH                  0x00000001

#define _IPC14_SPI2RXIP2_POSITION                0x0000000E
#define _IPC14_SPI2RXIP2_MASK                    0x00004000
#define _IPC14_SPI2RXIP2_LENGTH                  0x00000001

#define _IPC15_SPI3RXIP_POSITION                 0x00000000
#define _IPC15_SPI3RXIP_MASK                     0x00000007
#define _IPC15_SPI3RXIP_LENGTH                   0x00000003

#define _IPC15_DMA5IP_POSITION                   0x00000004
#define _IPC15_DMA5IP_MASK                       0x00000070
#define _IPC15_DMA5IP_LENGTH                     0x00000003

#define _IPC15_RTCIP_POSITION                    0x00000008
#define _IPC15_RTCIP_MASK                        0x00000700
#define _IPC15_RTCIP_LENGTH                      0x00000003

#define _IPC15_SPI3RXIP0_POSITION                0x00000000
#define _IPC15_SPI3RXIP0_MASK                    0x00000001
#define _IPC15_SPI3RXIP0_LENGTH                  0x00000001

#define _IPC15_SPI3RXIP1_POSITION                0x00000001
#define _IPC15_SPI3RXIP1_MASK                    0x00000002
#define _IPC15_SPI3RXIP1_LENGTH                  0x00000001

#define _IPC15_SPI3RXIP2_POSITION                0x00000002
#define _IPC15_SPI3RXIP2_MASK                    0x00000004
#define _IPC15_SPI3RXIP2_LENGTH                  0x00000001

